Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/buying_a_home/mortgage_interest_relief.html.txt.tmx
Source language: en
Languages: ga

source: Mortgage interest relief is a tax relief based on the amount of qualifying mortgage interest that you pay in a given tax year for your principal private residence (your home)
ga: Is éard is faoiseamh morgáiste ann ná faoiseamh cánach bunaithe ar an méid den ús morgáiste a íocann tú ar do phríomháras cónaithe príobháideach (do theach féin) i mbliain chánach áirithe

source: A tax year means the period from 1 January to 31 December
ga: Séard is brí le bliain chánach ná an treimhse idir 1 Eanáir agus 31 Nollaig

source: Mortgages taken out after 31 December 2012 do not qualify for mortgage interest relief
ga: Éilíonn do mhorgaisteoir méid an fhaoisimh ar ais os na Coimisinéirí Ioncaim

source: Mortgage interest relief was due to be abolished entirely after 31 December 2017
ga: Cuirfear deireadh iomlán le faoiseamh cánach ar ús morgáiste i ndiaidh an 31 Nollaig 2017

source: For you to qualify for tax relief on mortgage interest repayments, the interest must relate to money that you have borrowed to purchase, repair or improve your sole or main residence
ga: Chun go gcáileoidh sé d’fhaoiseamh cánach ar íocaíochtaí ús morgáiste, ní mór don ús a bheith ar airgead a fuair tú ar iasacht chun do phríomh-áitreabh (atá suite in Éirinn) a cheannach, a dheisiú nó a fheabhsú

source: For example, you cannot claim mortgage interest relief for interest on a loan used to buy a holiday home or investment property, but you can claim it if the loan is to extend or improve your main home
ga: Mar shampla, ní féidir faoiseamh morgáiste a éileamh i gcomhair úis ar iasacht a úsáideadh chun teach saoire nó réadmhaoin infheistíochta a cheannach ach is féidir é a éileamh i gcomhair iasacht a úsáideadh chun do phríomhtheach a fheabhsú nó a shíneadh

source: If you work and pay taxes in the UK (including Northern Ireland) but your sole or main residence is in the State, you can claim relief on the interest you pay on the mortgage
ga: Is féidir leat faoiseamh ar ús morgáiste a éileamh má tá do phríomháit chónaithe nó d’áit chónaithe aonair in Éirinn agus má oibríonn tú agus má íocann tú cánacha sa RA (lena n-áirítear Tuaisceart Éireann)

source: You will need to have a Personal Public Service Number (PPSN) in order to claim the relief
ga: Is gá uimhir Phearsanta Seirbhíse Poiblí (PSP) a bheith agat chun an faoiseamh a éileamh

source: Relief is also subject to upper limits, which will depend on your personal situation and whether you are a first-time buyer - see Rates and ceilings for details
ga: Tá an faoiseamh seo faoi réir uasteorainneacha, ag brath ar do chúinsí pearsanta agus an ceannaitheoir céad-uaire tú nó nach ea - féach 'Rátaí agus uasteorainneacha' thíos

source: Mortgage start date and entitlement to relief
ga: Dáta tosaithe morgáiste agus teidlíocht maidir le faoiseamh

source: Your entitlement to mortgage interest relief depends on the relevant start date, as follows:
ga: Tosaíonn do theidlíocht d'fhaoiseamh cánach ar ús morgáiste sa chéad bhliain ina ndéanann tú íocaíocht úis cháilithe, amhail a leanas:

source: • If you started paying the mortgage in 2003 or earlier, your entitlement expired in 2009
ga: • Má thosaigh tú ag íoc an mhorgáiste in 2003 nó tráth níos luaithe ná seo, d’éag do theidlíocht in 2009

source: • For a mortgage taken out between 1 January 2004 and 31 December 2012, your entitlement to relief will continue until the end of 2017
ga: • I gcás morgáiste a glacadh idir an 1 Eanáir 2004 agus an 31 Nollaig 2012, leanfaidh do theidlíocht i leith faoiseamh cánach go dtí deireadh 2017

source: • Mortgages taken out after 31 December 2012 do not qualify for mortgage interest relief
ga: • Ní cheadaítear aon fhaoiseamh cánach ar ús morgáiste le haghaidh morgáistí a glacadh i ndiaidh an 31 Nollaig 2012

source: How the relief works
ga: Riaráistí morgáiste agus íocaíocht úis

source: The lender does this by reducing your mortgage repayment by the amount of tax relief you are entitled to in each tax year. Any amendments to this tax relief - for example, if there is a change in interest rates - are made automatically by your lender
ga: Cé go bhforálann an reachtaíocht a rialaíonn faoiseamh i leith ús morgáiste d’fhaoiseamh a dheonú bunaithe ar an méid ús cáilitheach a íocadh sa bhliain chánach, oibríonn go leor iasachtóirí an faoiseamh bunaithe ar an méid úis a gearradh ar chuntas, fiú murar íoc an t-iasachtóir an méid sin úis

source: You do not have to be earning a taxable income to qualify for mortgage interest relief
ga: Ba bheag tionchar a d’imir seo go dtí le déanaí

source: Normally, you do not claim mortgage interest relief in an annual tax return because it is given directly to you by your mortgage lender
ga: Mar fhreagairt ar riaráistí méadaitheacha, áfach, tá sé beartaithe go n-oibreoidh gach iasachtóir ar bhonn an úis a íocadh

source: However, in response to the growing incidence of mortgage arrears, since January 2014 all lenders are obliged to grant Tax Relief at Source (TRS) based on the amount of interest actually paid by the borrower within a tax year, in accordance with the legislation
ga: Ó Eanáir 2014 ar aghaidh, tá dualgas ar iasachtóirí Faoiseamh Cánach ag an bhFoinse (TRS) a dheonú bunaithe ar an méid úis a d’íoc an t-iasachtaí laistigh de bhliain chánach, mar a leagtar síos sa reachtaíocht

source: This change does not affect borrowers who make the full repayments on time, in accordance with their mortgage loan agreement
ga: Ní imríonn an t-athrú seo aon tionchar ar iasachtaithe a dhéanann na haisíocaíochtaí iomlán go tráthúil, i gcomhréir lena gcomhaontú iasacht mhorgáiste

source: For borrowers who do not make their repayments or who pay less than the amount of interest charged to their account, the TRS amount due is reduced to reflect the actual amount of interest paid
ga: I gcás iasachtaithe nach ndéanann a n-aisíocaíochtaí nó a íocann níos lú ná an méid úis a gearradh ar a gcuntas, laghdófar méid an TRS leis an méid úis a íocadh a léiriú

source: As regards interest-only arrangements, people who are only paying the interest portion of their mortgage are still entitled to TRS and will continue to get it if they meet the qualifying conditions
ga: Maidir le socruithe úis amháin, tá daoine nach bhfuil ach sciar an úis dá morgáiste á íoc acu fós i dteideal TRS a fháil agus leanfaidh siad lena fháil má chomhlíonann siad na coinníollacha cáilitheachta

source: Read more in Revenue's Frequently Asked Questions
ga: Is féidir leat níos mó a léamh faoi seo i gCeisteanna Coitianta na gCoimisinéirí Ioncaim

source: There are different rates and ceilings for mortgage interest relief, depending on your circumstances
ga: Tá rátaí agus uasteorainneacha éagsúla ann le haghaidh faoiseamh i leith ús morgáiste, ag brath ar do chuid cúinsí

source: Revenue has published detailed tables, which show how the various rates and ceilings are applied
ga: D’fhoilsigh na Coimisinéirí Ioncaim táblaí sonracha, ina léirítear conas a chuirtear na rátaí agus na huasteorainneacha éagsúla i bhfeidhm

source: You can use these tables to calculate how much mortgage interest relief you will get each year
ga: Féadfaidh tú na táblaí seo a úsáid lena ríomh cé mhéid faoiseamh i leith ús morgáiste a gheobhaidh tú gach bliain

source: You are a first-time buyer for the purposes of mortgage interest relief if you are in the first 7 tax years of receiving it
ga: Ceannaitheoir céaduaire thú maidir le cúrsaí faoisimh i leith ús morgáiste má tá tú sa chéad 7 mbliana cánach tar éis é a fháil

source: Rates of relief for first-time buyers are generally reduced over the lifetime of the mortgage
ga: Is gnách go laghdaítear rátaí faoisimh i gcás ceannaitheoirí céaduaire thar shaolré an mhorgáiste

source: However, for mortgages taken out by first-time buyers between 1 January 2004 and 31 December 2008, there is a special rate of 30% for the tax years 2012 to 2017
ga: I gcás morgáistí a ghlac ceannaitheoirí céaduaire, áfach, idir an 1 Eanáir 2004 agus an 31 Nollaig 2008, tá ráta speisialta 30% ann do na blianta cánach idir 2012 agus 2017

source: Rates for non-first-time buyers
ga: Ceannaitheoirí nach ceannaitheoirí céad-uaire

source: If you are not a first-time buyer, the rate of mortgage interest relief is 15%
ga: Mura bhfuil tú id cheannaitheoir céad-uaire, is é an ráta faoisimh i leith úis morgáiste 15%

source: The amount of mortgage interest on which you can get relief is subject to upper limits or ceilings
ga: Is é suim an úis mhorgáiste ar ar féidir leat a fháil faoiseamh seo faoi réir uasteorainneacha nó uasteorainneacha

source: The ceiling that applies to you depends on your situation
ga: Tá an uasteorainn a bhaineann leat ag brath ar do chás

source: The following are the ceiling amounts for tax year 2016:
ga: Is iad seo a leanas na méideanna uasteorainn ar feadh na bliana cánach 2016:

source: Single Married/in a civil partnership/widowed/surviving civil partner
ga: │ │Singil │Baintreach/Baintreach fir/Páirtnéir sibhialta marthanach/Pósta/i bpáirtnéireacht shibhialta │

source: First-time buyer (bought in years 2004 to 2009) €3,000 €6,000
ga: │Ceannaitheoir céad-uaire (a cheannaigh sna blianta 2004 go 2009) │€3,000 │€6,000 │

source: First-time buyer (bought in years 2010 to 2012) €10,000 €20,000
ga: │Ceannaitheoir céad-uaire (a cheannaigh sna blianta 2010 go 2012) │€10,000│€20,000 │

source: Non-first-time buyer €3,000 €6,000
ga: │Ceannaitheoirí nach ceannaitheoirí céad-uaire iad │€3,000 │€6,000 │

source: In general, you should register online for mortgage interest relief
ga: Go ginearálta, ba cheart duit clárú ar líne le haghaidh faoiseamh i leith ús morgáiste

source: However, if you cannot use the online facility, you can contact the TRS Helpline on 1890 46 36 26 or email trsadmin@revenue.ie for assistance
ga: Murar féidir leat an áis ar líne a úsáid, áfach, ba cheart duit teagmháil a dhéanamh le Líne Chabhrach an TRS ag 1890 46 36 26 nó ríomhphost a sheoladh chuig trsadmin@revenue.ie chun cabhair a fháil

source: There is more information about TRS on the Revenue website
ga: Tá níos mó faisnéise ann faoin TRS ar láithreán gréasáin na gCoimisinéirí Ioncaim
